DISTORTEC/distortos/source/chip/STM32/STM32F1/include/distortos/chip/STM32F1-RCC-bits.h
#define RCC_AHBRSTR_ETHMACRST_bb			BITBAND(&RCC->AHBRSTR, RCC_AHBRSTR_ETHMACRST_bit)
#define RCC_AHBRSTR_OTGFSRST_bb				BITBAND(&RCC->AHBRSTR, RCC_AHBRSTR_OTGFSRST_bit)

/*---------------------------------------------------------------------------------------------------------------------+
| RCC_CFGR2 - Clock configuration register 2
+---------------------------------------------------------------------------------------------------------------------*/

#define RCC_CFGR2_I2S3SRC_bit				18
#define RCC_CFGR2_I2S2SRC_bit				17
#define RCC_CFGR2_PREDIV1SRC_bit			16
#define RCC_CFGR2_PLL3MUL_bit				12
#define RCC_CFGR2_PLL3MUL_0_bit				12
#define RCC_CFGR2_PLL3MUL_1_bit				13
#define RCC_CFGR2_PLL3MUL_2_bit				14
#define RCC_CFGR2_PLL3MUL_3_bit				15
#define RCC_CFGR2_PLL2MUL_bit				8
#define RCC_CFGR2_PLL2MUL_0_bit				8
#define RCC_CFGR2_PLL2MUL_1_bit				9
#define RCC_CFGR2_PLL2MUL_2_bit				10
#define RCC_CFGR2_PLL2MUL_3_bit				11
#define RCC_CFGR2_PREDIV2_bit				4
#define RCC_CFGR2_PREDIV2_0_bit				4
#define RCC_CFGR2_PREDIV2_1_bit				5
#define RCC_CFGR2_PREDIV2_2_bit				6
#define RCC_CFGR2_PREDIV2_3_bit				7
#define RCC_CFGR2_PREDIV1_bit				0
#define RCC_CFGR2_PREDIV1_0_bit				0
#define RCC_CFGR2_PREDIV1_1_bit				1
#define RCC_CFGR2_PREDIV1_2_bit				2
#define RCC_CFGR2_PREDIV1_3_bit				3

#define RCC_CFGR2_I2S3SRC_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_I2S3SRC_bit)
#define RCC_CFGR2_I2S2SRC_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_I2S2SRC_bit)
#define RCC_CFGR2_PREDIV1SRC_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV1SRC_bit)
#define RCC_CFGR2_PLL3MUL_0_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL3MUL_0_bit)
#define RCC_CFGR2_PLL3MUL_1_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL3MUL_1_bit)
#define RCC_CFGR2_PLL3MUL_2_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL3MUL_2_bit)
#define RCC_CFGR2_PLL3MUL_3_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL3MUL_3_bit)
#define RCC_CFGR2_PLL2MUL_0_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL2MUL_0_bit)
#define RCC_CFGR2_PLL2MUL_1_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL2MUL_1_bit)
#define RCC_CFGR2_PLL2MUL_2_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL2MUL_2_bit)
#define RCC_CFGR2_PLL2MUL_3_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PLL2MUL_3_bit)
#define RCC_CFGR2_PREDIV2_0_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV2_0_bit)
#define RCC_CFGR2_PREDIV2_1_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV2_1_bit)
#define RCC_CFGR2_PREDIV2_2_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV2_2_bit)
#define RCC_CFGR2_PREDIV2_3_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV2_3_bit)
#define RCC_CFGR2_PREDIV1_0_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV1_0_bit)
#define RCC_CFGR2_PREDIV1_1_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV1_1_bit)
#define RCC_CFGR2_PREDIV1_2_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV1_2_bit)
#define RCC_CFGR2_PREDIV1_3_bb				BITBAND(&RCC->CFGR2, RCC_CFGR2_PREDIV1_3_bit)

#endif	/* SOURCE_CHIP_STM32_STM32F1_INCLUDE_DISTORTOS_CHIP_STM32F1_RCC_BITS_H_ */
